function Cz = masivtoch(nz, Nz, id)
% Функція розрахунку кутових координат пікселів

% Nz - кількість точкок матриці по відповідній координаті
% nz - кількість точкок необхідних користувачеві
% Cz - масив можливих точко для відображення
% id - ідентифікатор відображення точок
% якщо id = 0 - не розраховувати
% якщо id = 1 - розраховувати

if id == 1
    % Розраховуємо нумерацію
    for i = 1:nz
        if i == 1
            % Якщо нам потрібна одна точка (центральна)
            if (nz == 1) && (Nz > 1)
                % Перевірка парності
                % якщо парне - то 2 точки
                % якщо непарне - то 1 точка
                if rem(Nz, 2) == 0
                    % парне
                    Cz(i) = 0.5 * Nz;
                    Cz(i + 1) = Cz(i) + 1;
                else
                    % непарне
                    Cz(i) = round(0.5 * Nz);
                end
            else
                % Всі інші варіанти, коли необхідна тільки перша точка
                % включно із {(nz == 1) && (Nz == 1)}
                Cz(i) = 1;
            end
            
        % Остання точка
        elseif (i == nz) && (nz > 1)
            if (nz > 2) && (rem(Nz, 2) == 0)
                Cz(i + 1) = Nz;
            else
                Cz(i) = Nz;
            end
            
        % Центральна точка
        elseif (i == round(0.5 * nz)) && (nz > 2)
            % Якщо нам потрібно більше 2-х точок
            % Перевірка парності
            % якщо парне - то 2 точки
            % якщо непарне - то 1 точка
            if rem(Nz, 2) == 0
                % парне
                Cz(i) = 0.5 * Nz;
                Cz(i + 1) = Cz(i) + 1;
            else
                % непарне
                Cz(i) = round(0.5 * Nz);
            end
        elseif (i > 1) && (i < round(0.5 * nz))
            % Перша половина значень
            Cz(i) = floor((Nz - 1) * (i - 1) / (nz - 1)) + 1;
            % (Nz - 1) - реальна довжина, а не порядок
        elseif (i > round(0.5 * nz)) && (i < nz) && (rem(Nz, 2) == 1)
            % Друга половина значень при непарному значенні Nz
            Cz(i) = ceil((Nz - 1) * (i - 1) / (nz - 1)) + 1;
            % (Nz - 1) - реальна довжина, а не порядок
        else
            % Друга половина значень при парному значенні Nz
            Cz(i + 1) = ceil((Nz - 1) * (i - 1) / (nz - 1)) + 1;
            % (Nz - 1) - реальна довжина, а не порядок
        end %
    end
else
    % Виводим все
    for i = 1:Nz
        Cz(i) = i;
    end
end

end
