function Cz = numbertoch(nz, Nz, id)
% Функція розрахунку кутових координат пікселів

% Nz - кількість точкок матриці по відповідній координаті
% nz - кількість точкок необхідних користувачеві
% Cz - кількість можливих точко для відображення
% id - ідентифікатор відображення точок
% якщо id = 0 - відображати всі
% якщо id = 1 - корегувати відображення

if id == 1
    % Перевірка парності, якщо парне - то робимо непарним
    % і робимо перевірку при якій значення не попадає у відповідну область при
    % якій необхідно віднімати по 1 точці
    if (rem(nz, 2) == 0) && (nz > 3)
        nz = nz - 1;
    end

    % Перевірка можливості відображення точок
    while nz > Nz
        % Перевірка кількості Nz
        if nz > 3
            nz = nz - 2;
        else
            % 3,2,1
            nz = nz - 1;
        end
    end

    % Виводим найдене значення
    Cz = nz;
else
    % Виводим все
    Cz = Nz;
end

end
